UNEXPECTED_REQUEST = "Неочікувана помилка. У разі проблем із підпискою зв’яжіться з підтримкою через меню бота. Номер замовлення: "
SECOND_FAILURE = '❌ Оплата не пройшла вдруге. Підписку скасовано. Вас видалено з чату і каналу'
REMOVED = '❌ Підписку скасовано в особистому кабінеті WayForPay. Вас видалено з чату і каналу'
REFUND = '❌ Оплату повернено. Підписку скасовано. Вас видалено з чату і каналу'
DECLINED = '❌ Оплата неуспішна. Спробуйте ще раз'
SUSPENDED = ('❌ Підписку призупинено в особистому кабінеті WayForPay. Вас видалено з чату і каналу. Якщо бажаєте поновити '
             'підписку — придбайте її знову через бота')
EXPIRED = '❌ Оплата неуспішна. Час на оплату вийшов. Спробуйте ще раз'
IN_PROGRESS = ("❌ Оплата зависла на стороні платіжної системи. У разі зняття коштів — скасуйте підписку в "
               "особистому кабінеті WayForPay і зв’яжіться з підтримкою через меню бота. Номер замовлення: ")
FIRST_FAILURE = ('❌ Оплату не вдалося списати. Завтра буде створено повторний платіж. У разі другої неуспішної оплати '
                 'Вас буде видалено з чату і каналу')
UNSUB = '✅ Успішно відписано від регулярного платежу. Вас видалено з чату і каналу'
SUB_ABSENT = '❌ У Вас немає активної підписки'
SUPPORT = 'Щось не працює? Напишіть прямо сюди — https://www.instagram.com/nikolayalena.store'
NOT_ACTIVE_KICK = 'Платіжна система повідомила про неактивний статус регурярного платежу. Вас було видалено з чату і каналу'
FIRST_MESSAGE = '''
Привіт! 

Це бот для доступу до телеграм каналу Альони Ніколаєвої. Тут ви можете купити підписку, перевірити її статус, знайти відповіді на часті питання або звернутись по підтримку. 

Після оформлення підписки ви отримаєте запрошення до закритого каналу автоматично. Підписка триває місяць або пів року — як вам зручно. 

Списання повторюються автоматично, а за 3 дні до списання – буде приходити повідомлення-нагадування. 
'''
BUY_SUBSCRIPTION = 'Після оплати ви отримаєте доступ до каналу. Щоб оформити підписку, перейдіть за цим посиланням: \n{}'
FAQ = '''
1. Як довго триває підписка? 
Один або шість місяців — залежно від обраного пакету.

2. Як відбувається оплата? 
Через платіжну систему. Наступна оплата автоматично — бот нагадає за 3 дні. 

3. Як відписатись? 
Просто напиши «Хочу відписатись» у бот — і ми все зробимо.
'''
SUCCESS_PAYMENT = 'Оплата пройшла успішно ✅'
LINK_CHAT = 'Ось Ваше посилання на закритий чат {}\nЗверни увагу, що посилання діє протягом години'
LINK_CHANNEL = 'І посилання на закритий канал {}\nТеж діє діє протягом години'
ZOOM_LINK = 'Запис медитації:\n{}\n🧷 Код доступу: <code>{}</code>'
PAYMENT_IN_3_DAYS = '⏳ Привіт! До наступного платежу залишилось 3 дні!'
PAYMENT_ERROR = '❌ Помилка під час створення платежу.'
ACTIVE_SUBSCRIPTION = '✅ Ваша підписка активна. Дата наступного зняття: {}'
BROADCAST = 'Збережено. Напиши текст наступним повідомленням'
BROADCAST_SENT = '✅ Текст відправлено всім юзерам: {}'
SUBSCRIPTION_NAME = 'Підписка на канал Альони'
HELP_TEXT = ('Напишіть детально в чому виникла проблема. Або в нас ще є робочий інстік, можна туди також писати:'
             ' https://www.instagram.com/nikolayalena.store/')
MENU = 'Головне меню'
CHOOSE_FREQ = 'оберіть частоту списань:'
PRODUCT_COST = '{}\n\n{}\n\nВартість: {} EUR'
ORDER_INFO = 'Назва: {}\nОпис: {}\nПосилання: {}'
SHOW_INVOICE = 'інвойс на оплату:\n\n{}\n\nпісля оплати, посилання на товар буде в боті'
ORDER_LIST = 'ось список Ваших продуктів:'
UNSUB_OR_CHECK_STATUS_MENU = 'в цьому меню Ви можете відписатись або перевірити статус Вашої підписки'
BUY_SUB_MENU = 'в цьому меню Ви можете придбати підписку на приватний канал та чат Альони'
QUESTION_LIST = 'список поширених питань'
HOW_TO_PAY_ANSWER = ('Оберіть продукт, який хочете придбати, перейдіть за посиланням та натисніть на зручний спосіб '
                     '— Apple Pay, Google Pay або картка. Система все за вас зробить і надішле посилання на продукт'
                     ' сюди в бот. Якщо не виходить заплатити через посилання, напишіть в підтримку.')
RECORD_ANSWER = 'Звичайно :) На наступний день після онлайну — запис надішлемо сюди.'
RECEIVE_PRODUCT_ANSWER = ('Одразу після оплати вам прийде повідомлення в бот з посиланням. Якщо не приходить, але '
                          'оплата пройшла — напишіть нам, можливо, щось зламалось і таке буває.')
IF_NOT_ACCESS_ANSWER = ('Теж суперлегко, натиснути "відписатись" і підписатись знову. Таким чином система змінить ваші '
                        'данні картки.')
SUPPORT_ANSWER = 'Натисніть «треба допомога» в головному меню'
SUPPORT_RECEIVED_QUESTION = 'дякую. Підтримка отримала Ваш запит і відповість Вам у найближчий час у бот'
INACTIVE_CHAT = 'чат неактивний'
NEW_CHAT = '📩 нове звернення від {} | @{}\n\n{}'
NO_ADMIN_TAKE = ('наразі підтримка не взяла в роботу Ваш запит.\n\nОдразу після того, як підтримка візьме Ваш запит в '
                 'роботу, Ви зможете додати уточнення.')
USER_SENT = '👤 Юзер {}: {}'
ADMIN_JOIN = 'ви приєднались до чату, тепер усі ваші повідомлення йтимуть юзеру {}'
ADMIN_SENT = '‍💻 Адмін: {}'
ADMIN_CONFIRM = 'відправлено {}'
PAUSE_CHAT = ('чат з {} призупинено. Твої повідомлення не будуть йти юзеру. Його повідомлення будуть продовжувати '
              'тобі йти')
USER_CLOSED_CHAT = 'чат із підтримкою завершено'
ADMIN_CLOSED_CHAT = 'чат закрито ✅'
WRITE_PRODUCT_PRICE = 'напиши ціну в євро'
WRITE_PRODUCT_NAME = 'збережено ✅ Тепер введи назву продукту'
WRITE_PRODUCT_DESCR = 'збережено ✅️ Тепер введи опис продукту'
WRITE_PRODUCT_LINK = ('збережено ✅️ тепер введи посилання \n\nякщо ввести `.`, то при покупці юзеру прийде '
                      '`посилання прийде в бот за 30 хв до початку`')
PRODUCT_SAVED = ('✅ продукт збережено! Тепер його видно користувачам\n\nназва: {}\nціна: {} грн\nопис: '
                 '{}\nпосилання: {}')
PRODUCT_LIST = 'список продуктів:\n\n'
PRODUCT_ITEM = 'ID: {}, name: {}, price: {}, link: {}'
WRITE_PRODUCT_ID = 'напиши ID продукту'
MUST_BE_INT = 'має бути число, спробуй ще раз'
WRITE_EDIT_FIELD = 'збережено ✅️ тепер введи поле яке ти хочеш змінити (поле так як написано у списку товарів)'
WRITE_NEW_VALUE = 'збережено ✅️ тепер введи нове значення для цього поля'
EDIT_SUCCESS = 'успішно змінено поле {} на {} для ID {} ✅️'
WRITE_PRODUCT_ID_TO_BROADCAST = ('напиши ID продукту, власникам якого треба зробити розсилку. напиши \'-\''
                                 ' щоб відправити розсилку ВСІМ')
WRITE_DATE_TO_BROADCAST = ('збережено. Напиши дату наступним повідомленням\nформат: YYYY-MM-DD HH:MM\nНапиши'
                           ' \'-\' і текст відправться одразу')
WRONG_DATE_FORMAT = 'невірний формат дати. Використовуйте YYYY-MM-DD HH:MM'
CONFIRM_DATE_BROADCAST = 'запланувати повідомлення: \'{}\' на {}? так/ні'
YES = 'так'
NO = 'ні'
BROADCAST_PLANNED = 'повідомлення заплановано на {}'
BROADCAST_CANCELED = 'планування скасовано'
YES_OR_NO = 'будь ласка, напиши так або ні'
CHOOSE_CATEGORY = 'вибери категорію (1, 2, 3 або 4)\n\n1. актуальні\n2. записи вебінарів\n3. школа та інші\n4. архів'
MUST_BE_CATEGORY = 'має бути 1, 2, 3 або 4, спробуй ще раз'
PRODUCT_MOVED = 'продукт з ID `{}` переміщено в категорію {}'
NEW_CHAT_RECEIVED = '📩 звернення від {}'
NO_CHATS = 'звернення відсутні'
ALL_ORDERS = '\n\n Юзер: {}  |  Продукт: {}  |  Дата: {}  |  WFP: {}'
NO_ORDERS = 'покупки відсутні'
WRITE_PRODUCT_ID_REMOVE = 'напиши ID продукта, який ти хочеш видалити'
PRODUCT_REMOVED = 'продукт з ID `{}` видалено ✅'
LINK_WILL_BE_LATER = 'посилання прийде в бот за 30 хвилин до початку'
PRODUCT_LINK = 'посилання на продукт:\n{}'
PRODUCT_SUCCESS_PAYMENT = 'успішний платіж!\n\n{link_text}'
